УТ_для_edt/src/InformationRegisters/смартУчетСпециальныхПредложенийКлиентам/смартУчетСпециальныхПредложенийКлиентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартУчетСпециальныхПредложенийКлиентам</name>
  <comment>//++ #1960 смарт: Мосолов 08.08.2024 // Создание механизма для учета продаж по Доп. гарантии и спец предложений</comment>
  <resources>
    <name>СтоимостьПредложения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияПредложения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>РезультатПредложения</name>
    <type>
      <types>EnumRef.смартРезультатыПредложения</types>
    </type>
  </resources>
  <resources>
    <name>ВалютаПредложения</name>
    <comment>//++ #Б-3806 смарт: Фролов 14.07.2025 //Доработка механизмов учета предложения доп гарантии.</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>СтоимостьВВалюте</name>
    <comment>//++ #Б-3806 смарт: Фролов 14.07.2025 //Доработка механизмов учета предложения доп гарантии.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВидПредложения</name>
    <type>
      <types>EnumRef.смартВидыДополнительныхПредложений</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПредложения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураИсходная</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПредложения</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураПредложения</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаПредложения</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартВидыДополнительныхПредложений/смартВидыДополнительныхПредложений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартВидыДополнительныхПредложений</name>
  <comment>//++ #1960 смарт: Мосолов 08.08.2024 // Создание механизма для учета продаж по Доп. гарантии и спец предложений</comment>
  <enumValues>
    <name>ПредложениеДопГарантииПриПокупкеОборудования</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/InformationRegisters/смартУчетСпециальныхПредложенийКлиентам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции     

//++ #1960 смарт: Мосолов 08.08.2024 // Создание механизма для учета продаж по Доп. гарантии и спец предложений
Процедура ЗаписатьНаборЗаписейПоГарантии(ТаблицаТоваров, СсылкаНаДокумент, Валюта) Экспорт 
	
	Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		ТаблицаУсловийДопГарантии = смартОбщегоНазначения.ПолучитьСписокУсловийДопГарантииПоЗаказу(ТаблицаТоваров, СсылкаНаДокумент, Валюта); 
		
	ИначеЕсли ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		
		ТаблицаУсловийДопГарантии = смартОбщегоНазначения.ПолучитьСписокУсловийДопГарантииПоИнтересу(ТаблицаТоваров, СсылкаНаДокумент, Валюта); 
		
	Иначе
		
		Возврат;

	КонецЕсли;  
	
    Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаУсловийДопГарантии", ТаблицаУсловийДопГарантии);
	Запрос.УстановитьПараметр("ТаблицаДокумента", ТаблицаТоваров);
	Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
	Запрос.УстановитьПараметр("НоменклатураПредложения", Справочники.смартПредопределенныеЗначения.НоменклатураДополнительнойГарантии.Значение);
	
	Если ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.CRM_Интерес") Тогда
		
		Запрос.УстановитьПараметр("ДатаПредложения", ТекущаяДата()); 
		
	Иначе
		
		Запрос.УстановитьПараметр("ДатаПредложения", СсылкаНаДокумент.Дата); 
		
	КонецЕсли;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&СсылкаНаДокумент КАК ДокументПредложения,
	|	ТаблицаУсловийДопГарантии.Номенклатура КАК НоменклатураИсходная,
	|	ТаблицаУсловийДопГарантии.Характеристика КАК Характеристика,
	|	ТаблицаУсловийДопГарантии.Стоимость КАК СтоимостьПредложения
	|ПОМЕСТИТЬ ТоварыДокумента
	|ИЗ
	|	&ТаблицаУсловийДопГарантии КАК ТаблицаУсловийДопГарантии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	&ТаблицаДокумента КАК ТаблицаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	смартУчетСпециальныхПредложенийКлиентам.ВидПредложения КАК ВидПредложения,
	|	смартУчетСпециальныхПредложенийКлиентам.Менеджер КАК Менеджер,
	|	смартУчетСпециальныхПредложенийКлиентам.ДатаПредложения КАК ДатаПредложения,
	|	смартУчетСпециальныхПредложенийКлиентам.НоменклатураИсходная КАК НоменклатураИсходная,
	|	смартУчетСпециальныхПредложенийКлиентам.ДокументПредложения КАК ДокументПредложения,
	|	смартУчетСпециальныхПредложенийКлиентам.НоменклатураПредложения КАК НоменклатураПредложения,
	|	смартУчетСпециальныхПредложенийКлиентам.ХарактеристикаПредложения КАК ХарактеристикаПредложения,
	|	смартУчетСпециальныхПредложенийКлиентам.СтоимостьПредложения КАК СтоимостьПредложения,
	|	смартУчетСпециальныхПредложенийКлиентам.ДатаОкончанияПредложения КАК ДатаОкончанияПредложения,
	|	смартУчетСпециальныхПредложенийКлиентам.РезультатПредложения КАК РезультатПредложения
	|ПОМЕСТИТЬ ТоварыРегистра
	|ИЗ
	|	РегистрСведений.смартУчетСпециальныхПредложенийКлиентам КАК смартУчетСпециальныхПредложенийКлиентам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаДокумента КАК ТаблицаДокумента
	|		ПО смартУчетСпециальныхПредложенийКлиентам.НоменклатураИсходная = ТаблицаДокумента.Номенклатура
	|ГДЕ
	|	смартУчетСпециальныхПредложенийКлиентам.ДокументПредложения = &СсылкаНаДокумент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	&СсылкаНаДокумент КАК ДокументПредложения,
	|	ЕСТЬNULL(ТоварыДокумента.НоменклатураИсходная, ТоварыРегистра.НоменклатураИсходная) КАК НоменклатураИсходная,
	|	ЕСТЬNULL(ТоварыДокумента.СтоимостьПредложения, ТоварыРегистра.СтоимостьПредложения) КАК СтоимостьПредложения,
	|	ЕСТЬNULL(ТоварыРегистра.ВидПредложения, ЗНАЧЕНИЕ(Перечисление.смартВидыДополнительныхПредложений.ПредложениеДопГарантииПриПокупкеОборудования)) КАК ВидПредложения,
	|	ЕСТЬNULL(ТоварыРегистра.Менеджер, ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ЕСТЬNULL(ТоварыДокумента.ДокументПредложения, ТоварыРегистра.ДокументПредложения)) = ТИП(Документ.ЗаказКлиента)
	|				ТОГДА ВЫРАЗИТЬ(ЕСТЬNULL(ТоварыДокумента.ДокументПредложения, ТоварыРегистра.ДокументПредложения) КАК Документ.ЗаказКлиента).Менеджер
	|			ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ТоварыДокумента.ДокументПредложения, ТоварыРегистра.ДокументПредложения) КАК Документ.CRM_Интерес).Ответственный
	|		КОНЕЦ) КАК Менеджер,
	|	ЕСТЬNULL(ТоварыРегистра.ДатаПредложения, &ДатаПредложения) КАК ДатаПредложения,
	|	&НоменклатураПредложения КАК НоменклатураПредложения,
	|	ЕСТЬNULL(ТоварыРегистра.ХарактеристикаПредложения, ТоварыДокумента.Характеристика) КАК ХарактеристикаПредложения,
	|	ТоварыРегистра.ДатаОкончанияПредложения КАК ДатаОкончанияПредложения,
	|	ТоварыРегистра.РезультатПредложения КАК РезультатПредложения
	|ИЗ
	|	ТоварыРегистра КАК ТоварыРегистра
	|		ПОЛНОЕ СОЕДИНЕНИЕ ТоварыДокумента КАК ТоварыДокумента
	|		ПО ТоварыРегистра.ДокументПредложения = ТоварыДокумента.ДокументПредложения
	|			И ТоварыРегистра.НоменклатураИсходная = ТоварыДокумента.НоменклатураИсходная";

	
	НаборЗаписей = РегистрыСведений.смартУчетСпециальныхПредложенийКлиентам.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументПредложения.Установить(СсылкаНаДокумент);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	НаборЗаписей.Записать();
	
КонецПроцедуры //-- #1944 смарт: Мосолов 26.07.2024

#КонецОбласти

#КонецЕсли
